/*==========================================================================
  * Copyright (c)      Realtek Semiconductor Corporation, 2006
  * All rights reserved.
  * ========================================================================*/

/*================= File Description =======================================*/
/**
 * @file
 * 	This file is for color related functions.
 *
 * @author 	$Author$
 * @date 	$Date$
 * @version $Revision$
 */

/**
 * @addtogroup color
 * @{
 */

#ifndef _VIP_COLOR_H
#define _VIP_COLOR_H

/*================================ Definitions ==============================*/

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 * Header include
 ******************************************************************************/
#include <scaler/vipCommon.h>
#include <scaler/vipRPCCommon.h>
#include <scaler/scalerCommon.h>

/*******************************************************************************
 * Marco
 ******************************************************************************/

#define ENABLE_HDR_DM_22b_PATH 1

/*******************************************************************************
 * Variable
 ******************************************************************************/


/*******************************************************************************
* Constant
******************************************************************************/


#define _YUV2RGB_COEF_BY_Y_M3			0x03
#define _YUV2RGB_COEF_BY_Y_M4			0x04
#define _YUV2RGB_COEF_BY_Y_M5			0x05
#define _YUV2RGB_COEF_BY_Y_M6			0x06
#define _YUV2RGB_COEF_BY_Y_M7			0x07
#define _YUV2RGB_COEF_BY_Y_M8			0x08
#define _YUV2RGB_COEF_BY_Y_M9			0x09
#define _YUV2RGB_COEF_BY_Y_M10			0x0a
#define _YUV2RGB_COEF_BY_Y_M11			0x0b
#define _YUV2RGB_COEF_BY_Y_M12			0x0c
#define _YUV2RGB_COEF_BY_Y_M13			0x0d
#define _YUV2RGB_COEF_BY_Y_M14			0x0e
#define _YUV2RGB_COEF_BY_Y_M15			0x0f
#define _YUV2RGB_COEF_BY_Y_M16			0x10

#define _YUV2RGB_COEF_BY_Y_k11			0x00
#define _YUV2RGB_COEF_BY_Y_k12			0x01
#define _YUV2RGB_COEF_BY_Y_k13			0x02
#define _YUV2RGB_COEF_BY_Y_k22			0x03
#define _YUV2RGB_COEF_BY_Y_k23			0x04
#define _YUV2RGB_COEF_BY_Y_k32			0x05
#define _YUV2RGB_COEF_BY_Y_k33			0x06

#define VIP_DYNAMIC_DITHERING_TABLE_MAX	2

#define Bin_Num_sRGB 					128	/* Mac2=32, Sirius=128 (jyyang_2013/12/28)*/

#define IRE_PATTERN_USE_3D_PTG	1
typedef enum _HDR_SUB_YUV2RGB_TABLE {
	HDR_SUB_YUV2RGB_BT709_255_to_255=0,
	HDR_SUB_YUV2RGB_BT709_Limted_235_240_to_255 ,
	HDR_SUB_YUV2RGB_BT709_235_240_to_235,
	HDR_SUB_YUV2RGB_BT2020_255_to_255,
	HDR_SUB_YUV2RGB_BT2020_Limted_235_240_to_255 ,
	HDR_SUB_YUV2RGB_BT2020_235_240_to_235,
	HDR_SUB_YUV2RGB_601_255_to_255,
	HDR_SUB_YUV2RGB_601_Limted_235_240_to_255 ,
	HDR_SUB_YUV2RGB_601_235_240_to_235,

	HDR_SUB_YUV2RGB_ByPass_255_to_255,
	HDR_SUB_YUV2RGB_ByPass_Limted_235_to_255,

	HDR_SUB_YUV2RGB_TABLE_Max,

} HDR_SUB_YUV2RGB_TABLE;


typedef enum _HDR_SUB_COLOR_MAP_TABLE{
	HDR_SUB_disable_colorMap = 0,
	HDR_SUB_bt2020_2_bt709,
	HDR_SUB_bt709_2_bt2020,
	HDR_SUB_dcip3_2_bt709  ,
	HDR_SUB_bt709_2_dcip3  ,
	HDR_SUB_dcip3_2_bt2020 ,
	HDR_SUB_bt2020_2_dcip3 ,

	HDR_SUB_TABLE_NUM,
} HDR_SUB_COLOR_MAP_TABLE;


typedef enum _VIP_HDR_DM_CSC1_YUV2RGB_TABLE {
	HDR_DM_CSC1_YUV2RGB_BT709_Limted_235_240_to_255 = 0,
	HDR_DM_CSC1_YUV2RGB_BT709_255_to_255,
	HDR_DM_CSC1_YUV2RGB_BT2020_Limted_235_to_255,
	HDR_DM_CSC1_YUV2RGB_BT2020_255_to_255,
	HDR_DM_CSC1_YUV2RGB_ByPass_255_to_255,
	HDR_DM_CSC1_YUV2RGB_ByPass_Limted_235_to_255,

	HDR_DM_CSC1_YUV2RGB_BT601_Limted_235_240_to_255,
	HDR_DM_CSC1_YUV2RGB_BT601_255_to_255,

	HDR_DM_CSC1_YUV2RGB_ByPass_GBRtoRGB_255_to_255,
	HDR_DM_CSC1_YUV2RGB_ByPass_GBRtoRGB_Limted_235_to_255,

	HDR_DM_CSC1_YUV709toRGB709_FtoF,
	HDR_DM_CSC1_YUV2020toRGB2020_FtoF,
	HDR_DM_CSC1_YUV709toRGB709_LtoF,
	HDR_DM_CSC1_YUV2020toRGB2020_LtoF,
	HDR_DM_CSC1_Inv2020_RGB709toRGB709_FtoF,
	HDR_DM_CSC1_Inv2020_RGB709toRGB709_LtoF,
	HDR_DM_CSC1_YUV601toRGB601_FtoF,
	HDR_DM_CSC1_YUV601toRGB601_LtoF,

	HDR_DM_CSC1_YUV2RGB_HDR10_VIVID_235_to_255,

	VIP_HDR_DM_CSC1_YUV2RGB_TABLE_Max,

} VIP_HDR_DM_CSC1_YUV2RGB_TABLE;
#if 0	// move to vipcommon
#define HDR_TABLE_NUM 5
/*#define HDR_RGB2YUV_TABLE_NUM 5*/

typedef enum {
	HDR_RGB2OPT_709_TO_2020 = 0,
	HDR_RGB2OPT_2020_TO_709,
	HDR_RGB2OPT_DCI_TO_709,
	HDR_RGB2OPT_DCI_TO_2020,
	HDR_RGB2OPT_2020_TO_DCI,
	HDR_RGB2OPT_RGB_TO_Y,
	HDR_RGB2OPT_RGB2020_TO_RGB709_F2F,
	HDR_RGB2OPT_TABLE_NUM,
} HDR_RGB2OPT_TABLE;
#endif

typedef union
{
	unsigned char IPCtrlBits;	// IP control bits
	struct{
		unsigned char reserve_bit:4;
		unsigned char ctrl_by_AP_not_finish:1;
		unsigned char i2run_run:1;	/* in i2run flow, IP set or not */
		unsigned char seamless_run:1;	/* in seamless flow, IP set or not	*/
		unsigned char control_by_PQ:1;	/* 1:control by PQ flow, 0: conctrol by AP/scaler/...	*/
	};
} HDR_IP_ctrl_bits;


#define HFC_control_by_PQ 0x01
#define HFC_seamless_run 0x02
#define HFC_i2run_run 0x04
#define HFC_ctrl_ReLoad 0x08
#define HFC_OETF_CTRL_BY_MAXCLL 250
#define HFC_EOTF_CTRL_BY_MAXCLL 250
#define HFC_RGB2OPT_OFF 255
#define HFC_EOTF_OFF 255
#define HFC_OETF_OFF 255
#define HFC_CSC3_OFF 255
#define HFC_CSC3_ReLoad 254
#define HFC_CSC3_CTRL_BY_MAXCLL 250
#define HFC_TONE_MAPPING_OFF 255
#define HFC_OETF_ReLoad 254

typedef struct{
/*0*/	HDR_IP_ctrl_bits V_TOP_ctrl;
/*1*/	unsigned int V_TOP_reg_table;
/*2*/	HDR_IP_ctrl_bits swap_ctrl;
/*3*/	unsigned char swap_value;
/*4*/	HDR_IP_ctrl_bits HDR_420_to_422_ctrl;
/*5*/	unsigned char HDR_420_to_422_value;
/*6*/	HDR_IP_ctrl_bits HDR_422_to_444_ctrl;
/*7*/	unsigned char HDR_422_to_444_value;
/*8*/	HDR_IP_ctrl_bits CSC1_ctrl;
/*9*/	unsigned char CSC1_table;
/*10*/	HDR_IP_ctrl_bits CSC3_ctrl;
/*11*/	unsigned char CSC3_table;
/*12*/	HDR_IP_ctrl_bits HDR_33_1_ctrl;
/*13*/	unsigned char HDR_33_1_SPtable;		/*define special index: HFC_RGB2OPT_OFF*/
/*14*/	HDR_IP_ctrl_bits HDR_33_2_ctrl;
/*15*/	unsigned char HDR_33_2_table;
/*16*/	HDR_IP_ctrl_bits EOTF_ctrl;
/*17*/	unsigned char EOTF_SPtable;			/*define special index: HFC_EOTF_OFF*/
/*18*/	HDR_IP_ctrl_bits OETF_ctrl;
/*19*/	unsigned char OETF_SPtable;			/*define special index: HFC_OETF_CTRL_BY_MAXCLL, HFC_OETF_OFF*/
/*20*/	HDR_IP_ctrl_bits tone_mapping_ctrl;
/*21*/	unsigned char tone_mapping_table;
/*22*/	HDR_IP_ctrl_bits I3DDMA_33_ctrl;
/*23*/	unsigned char I3DDMA_33_table;
/*24*/	HDR_IP_ctrl_bits I3DDMA_422_to_444_ctrl;
/*25*/	unsigned char I3DDMA_422_to_444_value;
/*26*/	HDR_IP_ctrl_bits I_domain_R2Y_ctrl;
/*27*/	unsigned char I_domain_R2Y_table;
/*28*/	HDR_IP_ctrl_bits I_domain_422_to_444_ctrl;
/*29*/	unsigned char I_domain_422_to_444_value;
/*30*/	HDR_IP_ctrl_bits D_domain_Y2R_ctrl;
/*31*/	unsigned char D_domain_Y2R_table;
/*32*/	HDR_IP_ctrl_bits ST2094_ctrl;
/*33*/	unsigned char ST2094_enbale;
/*34*/	HDR_IP_ctrl_bits TC_ctrl;
/*35*/	unsigned char TC_enbale;
/*36*/	HDR_IP_ctrl_bits DM2_gamma_ctrl;
/*37*/	unsigned char DM2_gamma_enable;
/*38*/	HDR_IP_ctrl_bits CSC3_INDEX_ctrl;
/*39*/	unsigned char CSC3_INDEX_table;
} HDR_flow_control;


typedef enum _HDR_flow_control_timing {
	HFC_SDR_YUV = 0,
	HFC_SDR_RGB,
	HFC_DOLBY,
	HFC_USB_HDR10_YUV444_HD,
	HFC_USB_HDR10_YUV444_UHD,
	HFC_USB_HDR10_YUV422_HD,		/*5*/
	HFC_USB_HDR10_YUV422_UHD,
	HFC_USB_HDR10_YUV420_HD,
	HFC_USB_HDR10_YUV420_UHD,
	HFC_USB_HDR10_RGB_HD,
	HFC_USB_HDR10_RGB_UHD,			/*10*/
	HFC_USB_HLG_YUV444_HD,
	HFC_USB_HLG_YUV444_UHD,
	HFC_USB_HLG_YUV422_HD,
	HFC_USB_HLG_YUV422_UHD,
	HFC_USB_HLG_YUV420_HD,			/*15*/
	HFC_USB_HLG_YUV420_UHD,
	HFC_USB_HLG_RGB_HD,
	HFC_USB_HLG_RGB_UHD,
	HFC_DTV_HDR10_YUV444_HD,
	HFC_DTV_HDR10_YUV444_UHD,		/*20*/
	HFC_DTV_HDR10_YUV422_HD,
	HFC_DTV_HDR10_YUV422_UHD,
	HFC_DTV_HDR10_YUV420_HD,
	HFC_DTV_HDR10_YUV420_UHD,
	HFC_DTV_HDR10_RGB_HD,			/*25*/
	HFC_DTV_HDR10_RGB_UHD,
	HFC_DTV_HLG_YUV444_HD,
	HFC_DTV_HLG_YUV444_UHD,
	HFC_DTV_HLG_YUV422_HD,
	HFC_DTV_HLG_YUV422_UHD,			/*30*/
	HFC_DTV_HLG_YUV420_HD,
	HFC_DTV_HLG_YUV420_UHD,
	HFC_DTV_HLG_RGB_HD,
	HFC_DTV_HLG_RGB_UHD,
