//#include <rbus/hdmirx_2p1_phy_reg.h>
#include <rbus/efuse_reg.h>

//////////////////////
//Copy from Mac8p

//#include <rbus/hdmirx_2p0_phy_reg.h>  //From Mac7p need replace TBD
//#include <rbus/gdirx_hdmi20_phy_p0_reg.h>  //Mac8p
#include <rbus/hdmirx_phy_reg.h>  //Mac8p-> Merlin8

//#include <rbus/gdirx_hdmi20_dp14_phy_p1_regNew.h>  //Mac8p
//#include <rbus/gdirx_hdmi20_dp14_phy_p1_regNew.h>  //Mac8p


//////////////////////
//Copy from Mark2
#define HDMI_APHY0_BASE	    (0xB800DA04)   //DA04 ~ DAC0 (P0)   
#define HDMI_APHY1_BASE	    (0xB803BA04) 
#define HDMI_APHY2_BASE	    (0xB803CA04)   
#define HDMI_APHY3_BASE	    (0xB80B2A04) 

#define HDMI_DPHY0_BASE	    (0xB800DB00)   //DAFC ~ DD84 (P0) 
#define HDMI_DPHY1_BASE	    (0xB803BB00)  
#define HDMI_DPHY2_BASE	    (0xB803CB00)    
#define HDMI_DPHY3_BASE	    (0xB80B2B00)   

#define HDMI_APHY0_RSTB_BASE	    (0xB800DAFC) 
#define HDMI_APHY1_RSTB_BASE	    (0xB803BAFC) 
#define HDMI_APHY2_RSTB_BASE	    (0xB803CAFC) 
#define HDMI_APHY3_RSTB_BASE	    (0xB80B2AFC) 


struct hdmi21_aphy_reg_st {
	uint32_t z0k;  //BA04
	uint32_t z0pow;  //BA08
	uint32_t rsvd0;  //BA0C
	uint32_t top_in_0;  //BA10
	uint32_t top_in_1;  //BA14	
	uint32_t top_in_2;  //BA18	
	uint32_t rsvd1;  //BA1C	
	uint32_t top_out_0;  //BA20
	uint32_t top_out_1; //BA24
	uint32_t rsvd2;  //BA28
	uint32_t rsvd3;  //BA2C
	uint32_t ck0; //BA30
	uint32_t ck1; //BA34
	uint32_t ck2; //BA38
	uint32_t ck3; //BA3C
	uint32_t ck4; //BA40
	uint32_t acdr_ck0;  //BA44
	uint32_t acdr_ck1;  //BA48
	uint32_t acdr_ck2;  //BA4C
	uint32_t b0;  //BA50
	uint32_t b1;  //BA54
	uint32_t b2;  //BA58
	uint32_t b3;  //BA5C
	uint32_t b4;  //BA60
	uint32_t acdr_b0;  //BA64
	uint32_t acdr_b1;  //BA68
	uint32_t acdr_b2;  //BA6C
	uint32_t g0;  //BA70
	uint32_t g1;  //BA74
	uint32_t g2;  //BA78
	uint32_t g3;  //BA7C
	uint32_t g4;  //BA80
	uint32_t acdr_g0;  //BA84
	uint32_t acdr_g1;  //BA88
	uint32_t acdr_g2;  //BA8C
	uint32_t r0;  //BA90
	uint32_t r1;  //BA94
	uint32_t r2;  //BA98
	uint32_t r3;  //BA9C
	uint32_t r4;  //BAA0
	uint32_t acdr_r0;  //BAA4
	uint32_t acdr_r1;  //BAA8
	uint32_t acdr_r2;  //BAAC
	uint32_t rsvd4;  //BAB0
	uint32_t ck_cmu_1;  //BAB4;
	uint32_t ck_cmu_2;  //BAB8
	uint32_t ck_cmu_3;  //BABC
	uint32_t ck_cmu_4;  //BAC0
};

extern const struct hdmi21_aphy_reg_st *hd21_aphy[4];


///////////////////////////////////////////////////
#ifdef CONFIG_ARM64

#define HDMIRX_PHY_z0k_reg     	 	(unsigned int)(unsigned long)(&hd21_aphy[nport]->z0k)//BA04            
#define HDMIRX_PHY_z0pow_reg    	(unsigned int)(unsigned long)(&hd21_aphy[nport]->z0pow)//BA08	        
#define HDMIRX_PHY_top_in_0_reg 	(unsigned int)(unsigned long)(&hd21_aphy[nport]->top_in_0)//BA10       
#define HDMIRX_PHY_top_in_1_reg 	(unsigned int)(unsigned long)(&hd21_aphy[nport]->top_in_1)//BA14	      
#define HDMIRX_PHY_top_in_2_reg 	(unsigned int)(unsigned long)(&hd21_aphy[nport]->top_in_2)//BA18	      
#define HDMIRX_PHY_top_out_0_reg 	(unsigned int)(unsigned long)(&hd21_aphy[nport]->top_out_0)//BA20      
#define HDMIRX_PHY_top_out_1_reg 	(unsigned int)(unsigned long)(&hd21_aphy[nport]->top_out_1)//BA24       
#define HDMIRX_PHY_rsvd0_reg    		(unsigned int)(unsigned long)(&hd21_aphy[nport]->rsvd0)//BA28          
#define HDMIRX_PHY_rsvd1_reg		(unsigned int)(unsigned long)(&hd21_aphy[nport]->rsvd1)//BA2C          
#define HDMIRX_PHY_ck0_reg			(unsigned int)(unsigned long)(&hd21_aphy[nport]->ck0)//BA30             
#define HDMIRX_PHY_ck1_reg			(unsigned int)(unsigned long)(&hd21_aphy[nport]->ck1)//BA34             
#define HDMIRX_PHY_ck2_reg 		(unsigned int)(unsigned long)(&hd21_aphy[nport]->ck2)//BA38             
#define HDMIRX_PHY_ck3_reg 		(unsigned int)(unsigned long)(&hd21_aphy[nport]->ck3)//BA3C             
#define HDMIRX_PHY_ck4_reg			(unsigned int)(unsigned long)(&hd21_aphy[nport]->ck4)//BA40             
#define HDMIRX_PHY_acdr_ck0_reg	 (unsigned int)(unsigned long)(&hd21_aphy[nport]->acdr_ck0)//BA44       
#define HDMIRX_PHY_acdr_ck1_reg	 (unsigned int)(unsigned long)(&hd21_aphy[nport]->acdr_ck1)//BA48       
#define HDMIRX_PHY_acdr_ck2_reg 	(unsigned int)(unsigned long)(&hd21_aphy[nport]->acdr_ck2)//BA4C       
#define HDMIRX_PHY_b0_reg       		(unsigned int)(unsigned long)(&hd21_aphy[nport]->b0)//BA50             
#define HDMIRX_PHY_b1_reg       		(unsigned int)(unsigned long)(&hd21_aphy[nport]->b1)//BA54             
#define HDMIRX_PHY_b2_reg       		(unsigned int)(unsigned long)(&hd21_aphy[nport]->b2)//BA58             
#define HDMIRX_PHY_b3_reg       		(unsigned int)(unsigned long)(&hd21_aphy[nport]->b3)//BA5C             
#define HDMIRX_PHY_b4_reg      		 (unsigned int)(unsigned long)(&hd21_aphy[nport]->b4)//DA60             
#define HDMIRX_PHY_acdr_b0_reg  	(unsigned int)(unsigned long)(&hd21_aphy[nport]->acdr_b0)//BA64        
#define HDMIRX_PHY_acdr_b1_reg  	(unsigned int)(unsigned long)(&hd21_aphy[nport]->acdr_b1)//BA68        
#define HDMIRX_PHY_acdr_b2_reg 	 (unsigned int)(unsigned long)(&hd21_aphy[nport]->acdr_b2)//BA6C        
#define HDMIRX_PHY_g0_reg       		(unsigned int)(unsigned long)(&hd21_aphy[nport]->g0)//BA70             
#define HDMIRX_PHY_g1_reg       		(unsigned int)(unsigned long)(&hd21_aphy[nport]->g1)//BA74             
#define HDMIRX_PHY_g2_reg      		(unsigned int)(unsigned long)(&hd21_aphy[nport]->g2)//BA78             
#define HDMIRX_PHY_g3_reg       		(unsigned int)(unsigned long)(&hd21_aphy[nport]->g3)//BA7C             
#define HDMIRX_PHY_g4_reg			(unsigned int)(unsigned long)(&hd21_aphy[nport]->g4)//BA80             
#define HDMIRX_PHY_acdr_g0_reg  	(unsigned int)(unsigned long)(&hd21_aphy[nport]->acdr_g0)//BA84        
#define HDMIRX_PHY_acdr_g1_reg		(unsigned int)(unsigned long)(&hd21_aphy[nport]->acdr_g1)//BA88        
#define HDMIRX_PHY_acdr_g2_reg		(unsigned int)(unsigned long)(&hd21_aphy[nport]->acdr_g2)//BA8C        
#define HDMIRX_PHY_r0_reg			(unsigned int)(unsigned long)(&hd21_aphy[nport]->r0)//BA90             
#define HDMIRX_PHY_r1_reg			(unsigned int)(unsigned long)(&hd21_aphy[nport]->r1)//BA94             
#define HDMIRX_PHY_r2_reg			(unsigned int)(unsigned long)(&hd21_aphy[nport]->r2)//BA98             
#define HDMIRX_PHY_r3_reg			(unsigned int)(unsigned long)(&hd21_aphy[nport]->r3)//BA9C             
#define HDMIRX_PHY_r4_reg			(unsigned int)(unsigned long)(&hd21_aphy[nport]->r4)//BAA0             
#define HDMIRX_PHY_acdr_r0_reg		(unsigned int)(unsigned long)(&hd21_aphy[nport]->acdr_r0)//BAA4        
#define HDMIRX_PHY_acdr_r1_reg		(unsigned int)(unsigned long)(&hd21_aphy[nport]->acdr_r1)//BAA8        
#define HDMIRX_PHY_acdr_r2_reg		(unsigned int)(unsigned long)(&hd21_aphy[nport]->acdr_r2)//BAAC        
#define HDMIRX_PHY_rsvd2_reg		(unsigned int)(unsigned long)(&hd21_aphy[nport]->rsvd2)//BAB0          
#define HDMIRX_PHY_ck_cmu_1_reg	(unsigned int)(unsigned long)(&hd21_aphy[nport]->ck_cmu_1)//BAB4      
#define HDMIRX_PHY_ck_cmu_2_reg	(unsigned int)(unsigned long)(&hd21_aphy[nport]->ck_cmu_2)//BAB8       
#define HDMIRX_PHY_ck_cmu_3_reg	(unsigned int)(unsigned long)(&hd21_aphy[nport]->ck_cmu_3)//BABC       
#define HDMIRX_PHY_ck_cmu_4_reg	(unsigned int)(unsigned long)(&hd21_aphy[nport]->ck_cmu_4)//BAC0

#else

#define HDMIRX_PHY_z0k_reg     	 	(unsigned int)(&hd21_aphy[nport]->z0k)//BA04            
#define HDMIRX_PHY_z0pow_reg    	(unsigned int)(&hd21_aphy[nport]->z0pow)//BA08	        
#define HDMIRX_PHY_top_in_0_reg 	(unsigned int)(&hd21_aphy[nport]->top_in_0)//BA10       
#define HDMIRX_PHY_top_in_1_reg 	(unsigned int)(&hd21_aphy[nport]->top_in_1)//BA14	      
#define HDMIRX_PHY_top_in_2_reg 	(unsigned int)(&hd21_aphy[nport]->top_in_2)//BA18	      
#define HDMIRX_PHY_top_out_0_reg 	(unsigned int)(&hd21_aphy[nport]->top_out_0)//BA20      
#define HDMIRX_PHY_top_out_1_reg 	(unsigned int)(&hd21_aphy[nport]->top_out_1)//BA24       
#define HDMIRX_PHY_rsvd0_reg    		(unsigned int)(&hd21_aphy[nport]->rsvd0)//BA28          
#define HDMIRX_PHY_rsvd1_reg		(unsigned int)(&hd21_aphy[nport]->rsvd1)//BA2C          
#define HDMIRX_PHY_ck0_reg			(unsigned int)(&hd21_aphy[nport]->ck0)//BA30             
#define HDMIRX_PHY_ck1_reg			(unsigned int)(&hd21_aphy[nport]->ck1)//BA34             
#define HDMIRX_PHY_ck2_reg 		(unsigned int)(&hd21_aphy[nport]->ck2)//BA38             
#define HDMIRX_PHY_ck3_reg 		(unsigned int)(&hd21_aphy[nport]->ck3)//BA3C             
#define HDMIRX_PHY_ck4_reg			(unsigned int)(&hd21_aphy[nport]->ck4)//BA40             
#define HDMIRX_PHY_acdr_ck0_reg	 (unsigned int)(&hd21_aphy[nport]->acdr_ck0)//BA44       
#define HDMIRX_PHY_acdr_ck1_reg	 (unsigned int)(&hd21_aphy[nport]->acdr_ck1)//BA48       
#define HDMIRX_PHY_acdr_ck2_reg 	(unsigned int)(&hd21_aphy[nport]->acdr_ck2)//BA4C       
#define HDMIRX_PHY_b0_reg       		(unsigned int)(&hd21_aphy[nport]->b0)//BA50             
#define HDMIRX_PHY_b1_reg       		(unsigned int)(&hd21_aphy[nport]->b1)//BA54             
#define HDMIRX_PHY_b2_reg       		(unsigned int)(&hd21_aphy[nport]->b2)//BA58             
#define HDMIRX_PHY_b3_reg       		(unsigned int)(&hd21_aphy[nport]->b3)//BA5C             
#define HDMIRX_PHY_b4_reg      		 (unsigned int)(&hd21_aphy[nport]->b4)//DA60             
#define HDMIRX_PHY_acdr_b0_reg  	(unsigned int)(&hd21_aphy[nport]->acdr_b0)//BA64        
#define HDMIRX_PHY_acdr_b1_reg  	(unsigned int)(&hd21_aphy[nport]->acdr_b1)//BA68        
#define HDMIRX_PHY_acdr_b2_reg 	 (unsigned int)(&hd21_aphy[nport]->acdr_b2)//BA6C        
#define HDMIRX_PHY_g0_reg       		(unsigned int)(&hd21_aphy[nport]->g0)//BA70             
#define HDMIRX_PHY_g1_reg       		(unsigned int)(&hd21_aphy[nport]->g1)//BA74             
#define HDMIRX_PHY_g2_reg      		(unsigned int)(&hd21_aphy[nport]->g2)//BA78             
#define HDMIRX_PHY_g3_reg       		(unsigned int)(&hd21_aphy[nport]->g3)//BA7C             
#define HDMIRX_PHY_g4_reg			(unsigned int)(&hd21_aphy[nport]->g4)//BA80             
#define HDMIRX_PHY_acdr_g0_reg  	(unsigned int)(&hd21_aphy[nport]->acdr_g0)//BA84        
#define HDMIRX_PHY_acdr_g1_reg		(unsigned int)(&hd21_aphy[nport]->acdr_g1)//BA88        
#define HDMIRX_PHY_acdr_g2_reg		(unsigned int)(&hd21_aphy[nport]->acdr_g2)//BA8C        
#define HDMIRX_PHY_r0_reg			(unsigned int)(&hd21_aphy[nport]->r0)//BA90             
#define HDMIRX_PHY_r1_reg			(unsigned int)(&hd21_aphy[nport]->r1)//BA94             
#define HDMIRX_PHY_r2_reg			(unsigned int)(&hd21_aphy[nport]->r2)//BA98             
#define HDMIRX_PHY_r3_reg			(unsigned int)(&hd21_aphy[nport]->r3)//BA9C             
#define HDMIRX_PHY_r4_reg			(unsigned int)(&hd21_aphy[nport]->r4)//BAA0             
#define HDMIRX_PHY_acdr_r0_reg		(unsigned int)(&hd21_aphy[nport]->acdr_r0)//BAA4        
#define HDMIRX_PHY_acdr_r1_reg		(unsigned int)(&hd21_aphy[nport]->acdr_r1)//BAA8        
#define HDMIRX_PHY_acdr_r2_reg		(unsigned int)(&hd21_aphy[nport]->acdr_r2)//BAAC        
#define HDMIRX_PHY_rsvd2_reg		(unsigned int)(&hd21_aphy[nport]->rsvd2)//BAB0          
#define HDMIRX_PHY_ck_cmu_1_reg	(unsigned int)(&hd21_aphy[nport]->ck_cmu_1)//BAB4      
#define HDMIRX_PHY_ck_cmu_2_reg	(unsigned int)(&hd21_aphy[nport]->ck_cmu_2)//BAB8       
#define HDMIRX_PHY_ck_cmu_3_reg	(unsigned int)(&hd21_aphy[nport]->ck_cmu_3)//BABC       
#define HDMIRX_PHY_ck_cmu_4_reg	(unsigned int)(&hd21_aphy[nport]->ck_cmu_4)//BAC0
#endif
/////////////////////


#define cmu_ck_1_HYS_AMP_EN								(_BIT6)   //CKAFE POWER

#define cmu_ck_1_HYS_WIN_SEL									(_BIT5|_BIT2)
#define cmu_ck_1_ENHANCE_BIAS_11								(_BIT5|_BIT2)
#define cmu_ck_1_ENHANCE_BIAS_10								(_BIT5)
#define cmu_ck_1_ENHANCE_BIAS_01								(_BIT2)
#define cmu_ck_1_ENHANCE_BIAS_00								(0)

#define cmu_ck_1_NON_HYS_CLKDIV									(_BIT4)
#define cmu_ck_1_MD_DET_SRC										(_BIT3)
#define cmu_ck_1_CKIN_SEL											(_BIT1)
#define cmu_ck_1_NON_HYS_AMP_EN									(_BIT0)  //CKD2S




//////////////////////
struct hdmi21_aphy_rstb_reg_st {
	uint32_t rega00;  //BAFC	
};

extern const struct hdmi21_aphy_rstb_reg_st *hd21_aphy_rstb[4];

#define HDMIRX_PHY_rega00	(unsigned int)(unsigned long)(&hd21_aphy_rstb[nport]->rega00)//BAFC	                

/////////////////////////////////////////////////

struct hdmi21_dphy_reg_st {
	
	uint32_t cdr_regd00;  //BB00
	uint32_t cdr_regd01;  //BB04
	uint32_t cdr_regd02;  //BB08
	uint32_t cdr_regd03;  //BB0C
//CDR_B	
	uint32_t cdr_regd04;  //BB10
//CDR_G	
	uint32_t cdr_regd05;  //BB14
//CDR_R	
	uint32_t cdr_regd06;  //BB18
//CDR_CK	
	uint32_t cdr_regd07;  //BB1C
//CDR_B		
	uint32_t cdr_regd08;  //BB20
//CDR_G
	uint32_t cdr_regd09;  //BB24
//CDR_R	
	uint32_t cdr_regd10;  //BB28
//CDR_CK	
	uint32_t cdr_regd11;  //BB2C
//CDR_B	
	uint32_t cdr_regd12;  //BB30
//CDR_G	
	uint32_t cdr_regd13;  //BB34
//CDR_R	
	uint32_t cdr_regd14;  //BB38
//CDR_CK	
	uint32_t cdr_regd15;  //BB3C
	
	uint32_t clk_regd00;  //BB40
       //KOFF B
	uint32_t koff_regd00;  //BB44
	uint32_t koff_regd01;  //BB48
	uint32_t koff_regd02;  //BB4C
	uint32_t koff_regd03;  //BB50
       //KOFF G	
	uint32_t koff_regd04;  //BB54
	uint32_t koff_regd05;  //BB58
	uint32_t koff_regd06;  //BB5C
	uint32_t koff_regd07;  //BB60
       //KOFF R	
	uint32_t koff_regd08;  //BB64
	uint32_t koff_regd09;  //BB68
	uint32_t koff_regd10;  //BB6C
	uint32_t koff_regd11;  //BB70
       //KOFF CK	
	uint32_t koff_regd12;  //BB74
	uint32_t koff_regd13;  //BB78
	uint32_t koff_regd14; //BB7C
	uint32_t koff_regd15; //BB80
	
	uint32_t koff_regd16; //BB84
	uint32_t data_regd00; //BB88
	uint32_t data_regd01; //BB8C
	uint32_t data_regd02; //BB90
	uint32_t data_regd03; //BB94
	
	uint32_t data_regd04; //BB98
	
	uint32_t data_regd05;  //BB9C
	uint32_t data_regd06;  //BBA0
	uint32_t data_regd07;  //BBA4
	uint32_t data_regd08;  //BBA8
	uint32_t data_regd09;  //BBAC
	uint32_t data_regd10;  //BBB0
	uint32_t rsvd4;  //BBB4
	//FLD_B
	uint32_t fld_regd00;  //BBB8
	uint32_t fld_regd01;  //BBBC
	uint32_t fld_regd02;  //BBC0
	uint32_t fld_regd03;  //BBC4
	uint32_t fld_regd04;  //BBC8
	uint32_t fld_regd05;  //BBCC
	uint32_t fld_regd06;  //BBD0
	
	uint32_t rsvd5;  //BBD4
	//FLD_G
	uint32_t fld_regd07;  //BBD8
	uint32_t fld_regd08;  //BBDC	
	uint32_t fld_regd09;  //BBE0		
	uint32_t fld_regd10;  //BBE4		
	uint32_t fld_regd11;  //BBE8		
	uint32_t fld_regd12;  //BBEC		
	uint32_t fld_regd13;  //BBF0		
	//FLD_R	
	uint32_t fld_regd14;  //BBF4
	uint32_t fld_regd15;  //BBF8		
	uint32_t fld_regd16;  //BBFC		
	uint32_t fld_regd17;  //BC00		
	uint32_t fld_regd18;  //BC04		
	uint32_t fld_regd19;  //BC08		
	uint32_t fld_regd20;  //BC0C		
	//FLD_CK	
	uint32_t fld_regd21;  //BC10		
	uint32_t fld_regd22;  //BC14		
	uint32_t fld_regd23;  //BC18		
	uint32_t fld_regd24;  //BC1C		
	uint32_t fld_regd25;  //BC20		
	uint32_t fld_regd26;  //BC4		
	uint32_t fld_regd27;  //BC8
	
	uint32_t mod_regd00;  //BCC	
	uint32_t mod_regd01;  //BC0	
	uint32_t pllcdr_regd00;  //BC34	
	uint32_t pllcdr_regd01;  //BC38	
	//PLLCDR_B	
	uint32_t pllcdr_regd02;  //BC3C	
	uint32_t pllcdr_regd03;  //BC40
	uint32_t pllcdr_regd04;  //BC44
	//PLLCDR_G	
	uint32_t pllcdr_regd05;  //BC48
	uint32_t pllcdr_regd06;  //BC4C
	uint32_t pllcdr_regd07;  //BC50
	//PLLCDR_R	
	uint32_t pllcdr_regd08;  //BC54
	uint32_t pllcdr_regd09;  //BC58
	uint32_t pllcdr_regd10;  //BC5C
	//PLLCDR_CK	
	uint32_t pllcdr_regd11;  //BC60
	uint32_t pllcdr_regd12;  //BC64
	uint32_t pllcdr_regd13;  //BC68
	
	uint32_t psave_regd00;  //BC6C
	uint32_t dfe_regd00;  //BC70
	uint32_t dfe_regd01;  //BC74
	uint32_t dfe_regd02;  //BC78
	uint32_t misc_regd00;  //BC7C
	uint32_t misc_regd01;  //BC80
	uint32_t misc_regd02;  //BC84
};


extern const struct hdmi21_dphy_reg_st *hd21_dphy[4];


/////////////////////////////////////////////////////
#ifdef CONFIG_ARM64
#define HDMIRX_PHY_cdr_regd00				(unsigned int)(unsigned long)(&hd21_dphy[nport]->cdr_regd00)//BB00         
#define HDMIRX_PHY_cdr_regd01				(unsigned int)(unsigned long)(&hd21_dphy[nport]->cdr_regd01)//BB04         
#define HDMIRX_PHY_cdr_regd02				(unsigned int)(unsigned long)(&hd21_dphy[nport]->cdr_regd02)//BB08         
#define HDMIRX_PHY_cdr_regd03				(unsigned int)(unsigned long)(&hd21_dphy[nport]->cdr_regd03)//BB0C         
#define HDMIRX_PHY_cdr_regd04				(unsigned int)(unsigned long)(&hd21_dphy[nport]->cdr_regd04)//BB10         
#define HDMIRX_PHY_cdr_regd05				(unsigned int)(unsigned long)(&hd21_dphy[nport]->cdr_regd05)//BB14         
#define HDMIRX_PHY_cdr_regd06				(unsigned int)(unsigned long)(&hd21_dphy[nport]->cdr_regd06)//BB18         
