#include <rbus/hdmirx_phy_reg.h>
#include <rbus/efuse_reg.h>

#define HDMI_APHY0_BASE	    (0xB800DA04)   //DA04 ~ DAC0 (P0)   
#define HDMI_APHY1_BASE	    (0xB803BA04) 
#define HDMI_APHY2_BASE	    (0xB803CA04)   
#define HDMI_APHY3_BASE	    (0xB80B2A04) 

#define HDMI_DPHY0_BASE	    (0xB800DC00)   //DAFC ~ DD84 (P0) 
#define HDMI_DPHY1_BASE	    (0xB803BC00)  
#define HDMI_DPHY2_BASE	    (0xB803CC00)    
#define HDMI_DPHY3_BASE	    (0xB80B2C00)   

#define HDMI_APHY0_RSTB_BASE	    (0xB800DAFC) 
#define HDMI_APHY1_RSTB_BASE	    (0xB803BAFC) 
#define HDMI_APHY2_RSTB_BASE	    (0xB803CAFC) 
#define HDMI_APHY3_RSTB_BASE	    (0xB80B2AFC) 




struct hdmi21_aphy_reg_st {
	uint32_t z0k;  //DA04
	uint32_t z0pow;  //DA08
	uint32_t rsvd0;  //DA0C
	uint32_t top_in_0;  //DA10
	uint32_t top_in_1;  //DA14	
	uint32_t top_in_2;  //DA18	
	uint32_t rsvd1;  //DA1C	
	uint32_t top_out_0;  //DA20
	uint32_t top_out_1; //DA24
	uint32_t rsvd2;  //DA28
	uint32_t rsvd3;  //DA2C
	uint32_t ck0; //DA30
	uint32_t ck1; //DA34
	uint32_t ck2; //DA38
	uint32_t ck3; //DA3C
	uint32_t ck4; //DA40
	uint32_t acdr_ck0;  //DA44
	uint32_t acdr_ck1;  //DA48
	uint32_t acdr_ck2;  //DA4C
	uint32_t b0;  //DA50
	uint32_t b1;  //DA54
	uint32_t b2;  //DA58
	uint32_t b3;  //DA5C
	uint32_t b4;  //DA60
	uint32_t acdr_b0;  //DA64
	uint32_t acdr_b1;  //DA68
	uint32_t acdr_b2;  //DA6C
	uint32_t g0;  //DA70
	uint32_t g1;  //DA74
	uint32_t g2;  //DA78
	uint32_t g3;  //DA7C
	uint32_t g4;  //DA80
	uint32_t acdr_g0;  //DA84
	uint32_t acdr_g1;  //DA88
	uint32_t acdr_g2;  //DA8C
	uint32_t r0;  //DA90
	uint32_t r1;  //DA94
	uint32_t r2;  //DA98
	uint32_t r3;  //DA9C
	uint32_t r4;  //DAA0
	uint32_t acdr_r0;  //DAA4
	uint32_t acdr_r1;  //DAA8
	uint32_t acdr_r2;  //DAAC
	uint32_t rsvd4;  //DAB0
	uint32_t ck_cmu_1;  //DAB4;
	uint32_t ck_cmu_2;  //DAB8
	uint32_t ck_cmu_3;  //DABC
	uint32_t ck_cmu_4;  //DAC0
};

extern const struct hdmi21_aphy_reg_st *hd21_aphy[4];


///////////////////////////////////////////////////


#define HDMIRX_PHY_z0k_reg     	 	(unsigned int)(&hd21_aphy[nport]->z0k)//DA04            
#define HDMIRX_PHY_z0pow_reg    	(unsigned int)(&hd21_aphy[nport]->z0pow)//DA08	        
#define HDMIRX_PHY_top_in_0_reg 	(unsigned int)(&hd21_aphy[nport]->top_in_0)//DA10       
#define HDMIRX_PHY_top_in_1_reg 	(unsigned int)(&hd21_aphy[nport]->top_in_1)//DA14	      
#define HDMIRX_PHY_top_in_2_reg 	(unsigned int)(&hd21_aphy[nport]->top_in_2)//DA18	      
#define HDMIRX_PHY_top_out_0_re 	(unsigned int)(&hd21_aphy[nport]->top_out_0)//DA20      
#define HDMIRX_PHY_top_out_1_re 	(unsigned int)(&hd21_aphy[nport]->top_out_1)//DA24       
#define HDMIRX_PHY_rsvd0_reg    		(unsigned int)(&hd21_aphy[nport]->rsvd0)//DA28          
#define HDMIRX_PHY_rsvd1_reg		(unsigned int)(&hd21_aphy[nport]->rsvd1)//DA2C          
#define HDMIRX_PHY_ck0_reg			(unsigned int)(&hd21_aphy[nport]->ck0)//DA30             
#define HDMIRX_PHY_ck1_reg			(unsigned int)(&hd21_aphy[nport]->ck1)//DA34             
#define HDMIRX_PHY_ck2_reg 		(unsigned int)(&hd21_aphy[nport]->ck2)//DA38             
#define HDMIRX_PHY_ck3_reg 		(unsigned int)(&hd21_aphy[nport]->ck3)//DA3C             
#define HDMIRX_PHY_ck4_reg			(unsigned int)(&hd21_aphy[nport]->ck4)//DA40             
#define HDMIRX_PHY_acdr_ck0_reg	 (unsigned int)(&hd21_aphy[nport]->acdr_ck0)//DA44       
#define HDMIRX_PHY_acdr_ck1_reg	 (unsigned int)(&hd21_aphy[nport]->acdr_ck1)//DA48       
#define HDMIRX_PHY_acdr_ck2_reg 	(unsigned int)(&hd21_aphy[nport]->acdr_ck2)//DA4C       
#define HDMIRX_PHY_b0_reg       		(unsigned int)(&hd21_aphy[nport]->b0)//DA50             
#define HDMIRX_PHY_b1_reg       		(unsigned int)(&hd21_aphy[nport]->b1)//DA54             
#define HDMIRX_PHY_b2_reg       		(unsigned int)(&hd21_aphy[nport]->b2)//DA58             
#define HDMIRX_PHY_b3_reg       		(unsigned int)(&hd21_aphy[nport]->b3)//DA5C             
#define HDMIRX_PHY_b4_reg      		 (unsigned int)(&hd21_aphy[nport]->b4)//DA60             
#define HDMIRX_PHY_acdr_b0_reg  	(unsigned int)(&hd21_aphy[nport]->acdr_b0)//DA64        
#define HDMIRX_PHY_acdr_b1_reg  	(unsigned int)(&hd21_aphy[nport]->acdr_b1)//DA68        
#define HDMIRX_PHY_acdr_b2_reg 	 (unsigned int)(&hd21_aphy[nport]->acdr_b2)//DA6C        
#define HDMIRX_PHY_g0_reg       		(unsigned int)(&hd21_aphy[nport]->g0)//DA70             
#define HDMIRX_PHY_g1_reg       		(unsigned int)(&hd21_aphy[nport]->g1)//DA74             
#define HDMIRX_PHY_g2_reg      		(unsigned int)(&hd21_aphy[nport]->g2)//DA78             
#define HDMIRX_PHY_g3_reg       		(unsigned int)(&hd21_aphy[nport]->g3)//DA7C             
#define HDMIRX_PHY_g4_reg			(unsigned int)(&hd21_aphy[nport]->g4)//DA80             
#define HDMIRX_PHY_acdr_g0_reg  	(unsigned int)(&hd21_aphy[nport]->acdr_g0)//DA84        
#define HDMIRX_PHY_acdr_g1_reg		(unsigned int)(&hd21_aphy[nport]->acdr_g1)//DA88        
#define HDMIRX_PHY_acdr_g2_reg		(unsigned int)(&hd21_aphy[nport]->acdr_g2)//DA8C        
#define HDMIRX_PHY_r0_reg			(unsigned int)(&hd21_aphy[nport]->r0)//DA90             
#define HDMIRX_PHY_r1_reg			(unsigned int)(&hd21_aphy[nport]->r1)//DA94             
#define HDMIRX_PHY_r2_reg			(unsigned int)(&hd21_aphy[nport]->r2)//DA98             
#define HDMIRX_PHY_r3_reg			(unsigned int)(&hd21_aphy[nport]->r3)//DA9C             
#define HDMIRX_PHY_r4_reg			(unsigned int)(&hd21_aphy[nport]->r4)//DAA0             
#define HDMIRX_PHY_acdr_r0_reg		(unsigned int)(&hd21_aphy[nport]->acdr_r0)//DAA4        
#define HDMIRX_PHY_acdr_r1_reg		(unsigned int)(&hd21_aphy[nport]->acdr_r1)//DAA8        
#define HDMIRX_PHY_acdr_r2_reg		(unsigned int)(&hd21_aphy[nport]->acdr_r2)//DAAC        
#define HDMIRX_PHY_rsvd2_reg		(unsigned int)(&hd21_aphy[nport]->rsvd2)//DAB0          
#define HDMIRX_PHY_ck_cmu_1_reg	(unsigned int)(&hd21_aphy[nport]->ck_cmu_1)//DAB4      
#define HDMIRX_PHY_ck_cmu_2_reg	(unsigned int)(&hd21_aphy[nport]->ck_cmu_2)//DAB8       
#define HDMIRX_PHY_ck_cmu_3_reg	(unsigned int)(&hd21_aphy[nport]->ck_cmu_3)//DABC       
#define HDMIRX_PHY_ck_cmu_4_reg	(unsigned int)(&hd21_aphy[nport]->ck_cmu_4)//DAC0


struct hdmi21_aphy_rstb_reg_st {
	uint32_t rega00;  //DAFC	
};

extern const struct hdmi21_aphy_rstb_reg_st *hd21_aphy_rstb[4];

#define HDMIRX_PHY_rega00	(unsigned int)(&hd21_aphy_rstb[nport]->rega00)//DAFC	                

/////////////////////////////////////////////////

struct hdmi21_dphy_reg_st {
	
	uint32_t cdr_regd00;  //DC00
	uint32_t cdr_regd01;  //DC04
	uint32_t cdr_regd02;  //DC08
	uint32_t cdr_regd03;  //DC0C
//CDR_B	
	uint32_t cdr_regd04;  //DC10
//CDR_G	
	uint32_t cdr_regd05;  //DC14
//CDR_R	
	uint32_t cdr_regd06;  //DC18
//CDR_CK	
	uint32_t cdr_regd07;  //DC1C
//CDR_B		
	uint32_t cdr_regd08;  //DC20
//CDR_G
	uint32_t cdr_regd09;  //DC24
//CDR_R	
	uint32_t cdr_regd10;  //DC28
//CDR_CK	
	uint32_t cdr_regd11;  //DC2C
//CDR_B	
	uint32_t cdr_regd12;  //DC30
//CDR_G	
	uint32_t cdr_regd13;  //DC34
//CDR_R	
	uint32_t cdr_regd14;  //DC38
//CDR_CK	
	uint32_t cdr_regd15;  //DC3C
	
	uint32_t clk_regd00;  //DC40
       //KOFF B
	uint32_t koff_regd00;  //DC44
	uint32_t koff_regd01;  //DC48
	uint32_t koff_regd02;  //DC4C
	uint32_t koff_regd03;  //DC50
       //KOFF G	
	uint32_t koff_regd04;  //DC54
	uint32_t koff_regd05;  //DC58
	uint32_t koff_regd06;  //DC5C
	uint32_t koff_regd07;  //DC60
       //KOFF R	
	uint32_t koff_regd08;  //DC64
	uint32_t koff_regd09;  //DC68
	uint32_t koff_regd10;  //DC6C
	uint32_t koff_regd11;  //DC70
       //KOFF CK	
	uint32_t koff_regd12;  //DC74
	uint32_t koff_regd13;  //DC78
	uint32_t koff_regd14; //DC7C
	uint32_t koff_regd15; //DC80
	
	uint32_t koff_regd16; //DC84
	uint32_t data_regd00; //DC88
	uint32_t data_regd01; //DC8C
	uint32_t data_regd02; //DC90
	uint32_t data_regd03; //DC94
	
	uint32_t data_regd04; //DC98
	
	uint32_t data_regd05;  //DC9C
	uint32_t data_regd06;  //DCA0
	uint32_t data_regd07;  //DCA4
	uint32_t data_regd08;  //DCA8
	uint32_t data_regd09;  //DCAC
	uint32_t data_regd10;  //DCB0
	uint32_t rsvd4;  //DCB4
	//FLD_B
	uint32_t fld_regd00;  //DCB8
	uint32_t fld_regd01;  //DCBC
	uint32_t fld_regd02;  //DCC0
	uint32_t fld_regd03;  //DCC4
	uint32_t fld_regd04;  //DCC8
	uint32_t fld_regd05;  //DCCC
	uint32_t fld_regd06;  //DCD0
	
	uint32_t rsvd5;  //DCD4
	//FLD_G
	uint32_t fld_regd07;  //DCD8
	uint32_t fld_regd08;  //DCDC	
	uint32_t fld_regd09;  //DCE0		
	uint32_t fld_regd10;  //DCE4		
	uint32_t fld_regd11;  //DCE8		
	uint32_t fld_regd12;  //DCEC		
	uint32_t fld_regd13;  //DCF0		
	//FLD_R	
	uint32_t fld_regd14;  //DCF4
	uint32_t fld_regd15;  //DCF8		
	uint32_t fld_regd16;  //DCFC		
	uint32_t fld_regd17;  //DD00		
	uint32_t fld_regd18;  //DD04		
	uint32_t fld_regd19;  //DD08		
	uint32_t fld_regd20;  //DD0C		
	//FLD_CK	
	uint32_t fld_regd21;  //DD10		
	uint32_t fld_regd22;  //DD14		
	uint32_t fld_regd23;  //DD18		
	uint32_t fld_regd24;  //DD1C		
	uint32_t fld_regd25;  //DD20		
	uint32_t fld_regd26;  //DD24		
	uint32_t fld_regd27;  //DD28
	
	uint32_t mod_regd00;  //DD2C	
	uint32_t mod_regd01;  //DD30	
	uint32_t pllcdr_regd00;  //DD34	
	uint32_t pllcdr_regd01;  //DD38	
	//PLLCDR_B	
	uint32_t pllcdr_regd02;  //DD3C	
	uint32_t pllcdr_regd03;  //DD40
	uint32_t pllcdr_regd04;  //DD44
	//PLLCDR_G	
	uint32_t pllcdr_regd05;  //DD48
	uint32_t pllcdr_regd06;  //DD4C
	uint32_t pllcdr_regd07;  //DD50
	//PLLCDR_R	
	uint32_t pllcdr_regd08;  //DD54
	uint32_t pllcdr_regd09;  //DD58
	uint32_t pllcdr_regd10;  //DD5C
	//PLLCDR_CK	
	uint32_t pllcdr_regd11;  //DD60
	uint32_t pllcdr_regd12;  //DD64
	uint32_t pllcdr_regd13;  //DD68
	
	uint32_t psave_regd00;  //DD6C
	uint32_t dfe_regd00;  //DD70
	uint32_t dfe_regd01;  //DD74
	uint32_t dfe_regd02;  //DD78
	uint32_t misc_regd00;  //DD7C
	uint32_t misc_regd01;  //DD80
	uint32_t misc_regd02;  //DD84
};


extern const struct hdmi21_dphy_reg_st *hd21_dphy[4];


/////////////////////////////////////////////////////

                                                                                            
#define HDMIRX_PHY_cdr_regd00				(unsigned int)(&hd21_dphy[nport]->cdr_regd00)//DC00         
#define HDMIRX_PHY_cdr_regd01				(unsigned int)(&hd21_dphy[nport]->cdr_regd01)//DC04         
#define HDMIRX_PHY_cdr_regd02				(unsigned int)(&hd21_dphy[nport]->cdr_regd02)//DC08         
#define HDMIRX_PHY_cdr_regd03				(unsigned int)(&hd21_dphy[nport]->cdr_regd03)//DC0C         
#define HDMIRX_PHY_cdr_regd04				(unsigned int)(&hd21_dphy[nport]->cdr_regd04)//DC10         
#define HDMIRX_PHY_cdr_regd05				(unsigned int)(&hd21_dphy[nport]->cdr_regd05)//DC14         
#define HDMIRX_PHY_cdr_regd06				(unsigned int)(&hd21_dphy[nport]->cdr_regd06)//DC18         
