
#ifndef CONFIG_CRYPTO_RTK_ZACC
#include <rtd_log/rtd_module_log.h>
#define zacc_fmt(fmt) "rtk_zacc:  " fmt
#define printk_always(fmt,...)  do{console_loglevel=6;rtd_pr_misc_err(zacc_fmt(fmt),##__VA_ARGS__);}while(0)

#include <linux/module.h>

#include <linux/kernel.h>

#include <linux/dma-mapping.h>
#include <linux/highmem.h>
#include <linux/list.h>
#include <linux/mm.h>
#include <linux/of.h>
#include <linux/platform_device.h>
#include <linux/spinlock.h>
#include <linux/smp.h>
#include <rbus/lzma_reg.h>
#include <rtk_kdriver/io.h>
#include <linux/delay.h>
#include <linux/smp.h>

#if 1
static void dmac_flush_range_ex (unsigned long start, unsigned long end)
{
    unsigned long ctr_el0;
    unsigned int cacheline_size;
    asm volatile("mrs %0, ctr_el0" : "=r" (ctr_el0) :: "memory");
    cacheline_size=2<<((ctr_el0>>16)&0xF);

    for(;start<end;start=start+cacheline_size)
    {    
        asm volatile("dc civac, %0" : : "r" (start) : "memory");
    }    
}
static void dmac_inv_range_ex (unsigned long start, unsigned long end)
{
    unsigned long ctr_el0;
    unsigned int cacheline_size;
    asm volatile("mrs %0, ctr_el0" : "=r" (ctr_el0) :: "memory");
    cacheline_size=2<<((ctr_el0>>16)&0xF);

    for(;start<end;start=start+cacheline_size)
    {    
        asm volatile("dc ivac, %0" : : "r" (start) : "memory");
    }    
}
#undef dmac_flush_range
#define dmac_flush_range dmac_flush_range_ex
#undef dmac_inv_range
#define dmac_inv_range dmac_inv_range_ex
#endif


#define ZACC_DEC_TIMEOUT_COUNT1     4000
#define ZACC_ENC_TIMEOUT_COUNT1 4000

#define ZACC_MAGIC_1 0xaa55aa55
#define  ZACC_MAGIC_2_1  0x2378beaf
#define  ZACC_MAGIC_2_2  0x2379beaf
#define  ZACC_MAGIC_3  0x5A414343

#define ZACC_DESC_SIZE      0x10
#define ZACC_QUEUE_SIZE 4
unsigned int zacc_hw_resource[ZACC_QUEUE_SIZE] = {0, 0, 0, 0};

const unsigned int reg_offset[ZACC_QUEUE_SIZE]= {0, 0x24, 0x4c, 0x70};

spinlock_t zacc_hw_lock;

#define CRC32_POLY  0x04c11db7      /* AUTODIN II, Ethernet, & FDDI */
unsigned int crc32_table[256];
static void init_crc32 (void)
{
    int i, j;
    unsigned int c;
    for (i = 0; i < 256; ++i)
    {
        for (c = i << 24, j = 8; j > 0; --j)
        {
            c = c & 0x80000000 ? (c << 1) ^ CRC32_POLY : (c << 1);
        }
        crc32_table[i] = c;
    }
}
unsigned int calc_crc32 (unsigned char *buf, u32 len)
{
    unsigned char   *p;
    unsigned int    crc;
    crc = 0xffffffff;       /* preload shift register, per CRC-32 spec */
    for (p = buf; len > 0; p++)
    {
        crc = (crc << 8) ^ crc32_table[(crc >> 24) ^ *(p)];
        if (len > 0)
        {
            len --;
        }
        else
        {
            len = 0;
        }
    }
    return(crc);
}

unsigned long par_64 (unsigned long addr, int user)
{
    unsigned long ret, phys_addr;
    if(user)
    {
        asm volatile("at s1e0r, %0; isb; dsb ish" : : "r" (addr));
    }
    else
    {
        asm volatile("at s1e1r, %0; isb; dsb ish" : : "r" (addr));
    }

    asm volatile("mrs %0, par_el1; dsb ish" : "=r" (ret));
    phys_addr=ret;
    //console_loglevel=6;
    //rtd_pr_misc_err("%s %d   %016llx   %016llx\n",__func__,__LINE__,addr,phys_addr);
    return phys_addr&0xFFFFF000;
}

#if 0
#include <linux/pageremap.h>
#include <linux/rtkrecord.h>
#else
//#include <rtk_kdriver/rmm/pageremap.h>
//#include <rtk_kdriver/rmm/rtkrecord.h>
void rtk_record_list_dump(void);
#endif
//void dump_decode_data (void const *src, unsigned int size, unsigned int crc32, unsigned int crc32_orig, unsigned int line )
void dump_decode_data (void const *src, unsigned int size, unsigned int line )
{
    console_loglevel = 7;

#if 0
    list_all_rtk_memory_allocation_sort(list_mem_generic,NULL,NULL);
    show_cma_avaliable();
#else
    rtk_record_list_dump();
#endif

    print_hex_dump(KERN_ERR, "rtlzma data input : ", DUMP_PREFIX_ADDRESS,16, 1, src, size, true);
    rtd_pr_misc_err("rtlzma data dump again  %d,    src: 0x%016llx|0x%016llx\n",line,src,par_64((unsigned long)src,0));
    print_hex_dump(KERN_ERR, "rtlzma data input : ", DUMP_PREFIX_ADDRESS,16, 1, (void *)((unsigned long)src&0xfffffffffffff000ULL), PAGE_SIZE, true);

#ifdef CONFIG_RTK_FEATURE_FOR_GKI
    dump_page(virt_to_page(src), "dump lzma decode buffer page");
#endif

    //panic("rtlzma data error! crc32: 0x%x|0x%x, src: 0x%016llx|0x%016llx\n", crc32, crc32_orig, src,par_64(src,0));
    panic("rtlzma data error! src: 0x%016llx|0x%016llx\n", src,par_64((unsigned long)src,0));
}


#pragma pack(push, 1)
struct zacc_encode_desc
{
    u32 encode:             1;      /* 0      - Encode mode (SW) */
    u32 decode:             1;      /* 1      - Decode mode (SW) */
    u32 bypss:              1;      /* 2      - Bypass mode (SW) */
    u32 cmd_err:            1;      /* 3      - Cmd error (HW) */
    u32 src_addr:           28;     /* 31:4   - Data source address (SW) */
    u32 hw_done:            1;      /* 32     - HW done (HW) */
    u32 over_4k:            1;      /* 33     - Size over 4KB (HW) */
    u32 unused_2:           2;      /* 35:34  - Unused */
    u32 dst_addr:           28;     /* 63:36  - Data destination address (SW) */
    u32 comp_size:          13;     /* 76:64  - Compressed size (HW) */
    u32 unused_1:           3;      /* 79:77  - Unused */
    u32 crc:                16;     /* 95:80  - Crc result (HW) */
    u32 unused_0:           32;     /* 127:96 - Unused */
};

struct zacc_decode_desc
{
    u32 encode:             1;      /*0       - Encode mode (SW) */
    u32 decode:             1;      /*1       - Decode mode (SW) */
    u32 bypass:             1;      /*2       - Bypass mode (SW) */
    u32 cmd_err:            1;      /*3       - Cmd error (HW) */
    u32 src_addr:           28;     /*31:4    - Data source address (SW) */
    u32 hw_done:            1;      /*32      - HW done (HW) */
    u32 size_err:           1;      /*33      - Size error (HW) */
    u32 decode_err:         1;      /*34      - Decode error (HW) */
    u32 dist_err:           1;      /*35      - Distance error (HW) */
    u32 dst_addr:           28;     /*63:36   - Data destination address (SW) */
    u32 comp_size:          23;     /*86:64   - Compressed size, 16bytes alignmen (SW) */
    u32 crc_err:            1;      /*87      - CRC error (HW) */
    u32 crc_msb:            8;      /*95:88   - Golden crc msb 8 bit (SW) */
    u32 decomp_size:        23;     /*118:96  - Decompressed size, byte (SW) */
    u32 unused_0:           1;      /*119     - Unused */
    u32 crc_lsb:            8;      /*127:120 - Golden crc lsb 8 bit (SW) */
};

struct zacc_desc
{
    u32 data[64];
};

#pragma pack(pop)

static void *desc_uncached;
static struct page *desc_page;
static dma_addr_t desc_phys;

static struct zacc_desc *desc;
static struct page *dst_pg[ZACC_QUEUE_SIZE];
static struct page *src_pg[ZACC_QUEUE_SIZE];
static struct page *src_tmp_pg[ZACC_QUEUE_SIZE];


unsigned int zacc_get_hw_resource (void)
{
    unsigned long flags;
    unsigned int index = 0xffffffff;
    unsigned int i;

    do
    {
        spin_lock_irqsave(&zacc_hw_lock, flags);

        for (i = 0; i < ZACC_QUEUE_SIZE; i++)
        {
            if (zacc_hw_resource[i] == 0)
            {
                index = i;
                zacc_hw_resource[i] = 1;
                break;
            }
        }

        spin_unlock_irqrestore(&zacc_hw_lock, flags);
    }
    while (index == 0xffffffff);
    return index;
}

